{"ast":null,"code":"import { __decorate } from \"tslib\";\nimport { Component } from '@angular/core';\nlet BoxTemplateComponent = class BoxTemplateComponent {\n  constructor() {\n    this.pageTitle = \"Pokemon Fun\";\n    this.Box1 = {\n      boxTitle: \"Squirtle\",\n      boxBody: \"Squirtle (Japanese: ゼニガメ Zenigame) is a Water-type Pokémon introduced in Generation I. It evolves into Wartortle starting at level 16, which evolves into Blastoise starting at level 36. Along with Bulbasaur and Charmander, Squirtle is one of the three starter Pokémon of Kanto available at the beginning of Pokémon Red, Green, Blue, FireRed, and LeafGreen.\",\n      boxButton() {\n        clicked: 0;\n      }\n    };\n    this.Box2 = {\n      boxTitle: \"Umbreon\",\n      boxBody: \"Umbreon (Japanese: ブラッキー Blacky) is a Dark-type Pokémon introduced in Generation II. It evolves from Eevee when leveled up with high friendship during the night or with a Moon ShardXD in the player's Bag, except in areas with a Moss Rock or Ice Rock or while knowing a Fairy-type moveSwShLASV (and having at least two levels of affectionVI–VII). It is one of Eevee's final forms, the others being Vaporeon, Jolteon, Flareon, Espeon, Leafeon, Glaceon, and Sylveon. Umbreon is the starter Pokémon of Pokémon Colosseum alongside Espeon.\",\n      boxButton() {}\n    };\n    this.Box3 = {\n      boxTitle: \"Charmander\",\n      boxBody: \"Charmander (Japanese: ヒトカゲ Hitokage) is a Fire-type Pokémon introduced in Generation I. It evolves into Charmeleon starting at level 16, which evolves into Charizard starting at level 36. Along with Bulbasaur and Squirtle, Charmander is one of the three starter Pokémon of Kanto available at the beginning of Pokémon Red, Green, Blue, FireRed, and LeafGreen.\",\n      boxButton() {}\n    };\n    this.Box4 = {\n      boxTitle: \"Bulbasaur\",\n      boxBody: \"Bulbasaur (Japanese: フシギダネ Fushigidane) is a dual-type Grass/Poison Pokémon introduced in Generation I. It evolves into Ivysaur starting at level 16, which evolves into Venusaur starting at level 32. Along with Charmander and Squirtle, Bulbasaur is one of the three starter Pokémon of Kanto available at the beginning of Pokémon Red, Green, Blue, FireRed, and LeafGreen.\",\n      boxButton() {}\n    };\n  }\n};\nBoxTemplateComponent = __decorate([Component({\n  selector: 'app-box-template',\n  templateUrl: './box-template.component.html',\n  styleUrls: ['./box-template.component.css']\n})], BoxTemplateComponent);\nexport { BoxTemplateComponent };","map":{"version":3,"mappings":";AAAA,SAASA,SAAS,QAAQ,eAAe;AAQlC,IAAMC,oBAAoB,GAA1B,MAAMA,oBAAoB;EAA1BC;IACL,cAAS,GAAG,aAAa;IACzB,SAAI,GAAS;MACXC,QAAQ,EAAG,UAAU;MACrBC,OAAO,EAAG,sWAAsW;MAChXC,SAAS;QACPC,OAAO,EAAG,CAAC;MACb;KACD;IACD,SAAI,GAAS;MACXH,QAAQ,EAAG,SAAS;MACpBC,OAAO,EAAG,uhBAAuhB;MACjiBC,SAAS,IAAI;KACd;IACD,SAAI,GAAS;MACXF,QAAQ,EAAG,YAAY;MACvBC,OAAO,EAAG,wWAAwW;MAClXC,SAAS,IAAI;KACd;IACD,SAAI,GAAS;MACXF,QAAQ,EAAG,WAAW;MACtBC,OAAO,EAAG,oXAAoX;MAC9XC,SAAS,IAAI;KACd;EACH;CAAC;AAxBYJ,oBAAoB,eALhCD,SAAS,CAAC;EACTO,QAAQ,EAAE,kBAAkB;EAC5BC,WAAW,EAAE,+BAA+B;EAC5CC,SAAS,EAAE,CAAC,8BAA8B;CAC3C,CAAC,GACWR,oBAAoB,CAwBhC;SAxBYA,oBAAoB","names":["Component","BoxTemplateComponent","constructor","boxTitle","boxBody","boxButton","clicked","selector","templateUrl","styleUrls"],"sourceRoot":"","sources":["C:\\Users\\Jaehyeok Lee\\Desktop\\Antra\\Advanced Training\\Assignments\\Assignments\\Assignment1\\src\\app\\box-template\\box-template.component.ts"],"sourcesContent":["import { Component } from '@angular/core';\nimport { Box } from './box';\n\n@Component({\n  selector: 'app-box-template',\n  templateUrl: './box-template.component.html',\n  styleUrls: ['./box-template.component.css']\n})\nexport class BoxTemplateComponent {\n  pageTitle = \"Pokemon Fun\";\n  Box1 : Box = {\n    boxTitle : \"Squirtle\",\n    boxBody : \"Squirtle (Japanese: ゼニガメ Zenigame) is a Water-type Pokémon introduced in Generation I. It evolves into Wartortle starting at level 16, which evolves into Blastoise starting at level 36. Along with Bulbasaur and Charmander, Squirtle is one of the three starter Pokémon of Kanto available at the beginning of Pokémon Red, Green, Blue, FireRed, and LeafGreen.\",\n    boxButton() {\n      clicked : 0;\n    }\n  }\n  Box2 : Box = {\n    boxTitle : \"Umbreon\",\n    boxBody : \"Umbreon (Japanese: ブラッキー Blacky) is a Dark-type Pokémon introduced in Generation II. It evolves from Eevee when leveled up with high friendship during the night or with a Moon ShardXD in the player's Bag, except in areas with a Moss Rock or Ice Rock or while knowing a Fairy-type moveSwShLASV (and having at least two levels of affectionVI–VII). It is one of Eevee's final forms, the others being Vaporeon, Jolteon, Flareon, Espeon, Leafeon, Glaceon, and Sylveon. Umbreon is the starter Pokémon of Pokémon Colosseum alongside Espeon.\",\n    boxButton() {}\n  }\n  Box3 : Box = {\n    boxTitle : \"Charmander\",\n    boxBody : \"Charmander (Japanese: ヒトカゲ Hitokage) is a Fire-type Pokémon introduced in Generation I. It evolves into Charmeleon starting at level 16, which evolves into Charizard starting at level 36. Along with Bulbasaur and Squirtle, Charmander is one of the three starter Pokémon of Kanto available at the beginning of Pokémon Red, Green, Blue, FireRed, and LeafGreen.\",\n    boxButton() {}\n  }\n  Box4 : Box = {\n    boxTitle : \"Bulbasaur\",\n    boxBody : \"Bulbasaur (Japanese: フシギダネ Fushigidane) is a dual-type Grass/Poison Pokémon introduced in Generation I. It evolves into Ivysaur starting at level 16, which evolves into Venusaur starting at level 32. Along with Charmander and Squirtle, Bulbasaur is one of the three starter Pokémon of Kanto available at the beginning of Pokémon Red, Green, Blue, FireRed, and LeafGreen.\",\n    boxButton() {}\n  }\n}\n"]},"metadata":{},"sourceType":"module","externalDependencies":[]}